{"blogPosts":[],"projects":[{"cover":"https://raw.githubusercontent.com/yasserbdj96/hiphp/main/screenshot/screenshot.png","description":"The BackDoor of HIPHP gives you the power to control websites based on PHP using HTTP/HTTPS protocol. By sending files, tokens and commands through port 80's POST/GET method, users can access a range of activities such as downloading and editing files. It also allows for connecting to Tor networks with password protection for extra security.","details":"What is Hiphp?\r\nThe HIPHP BackDoor is an open-source tool that allows for remote control of websites utilizing the PHP programming language via the HTTP/HTTPS protocol. By utilizing the POST/GET method on port 80, users can access a range of functionalities such as file downloading and editing. Additionally, it offers the capability to connect to Tor networks, providing an added layer of security through the use of password protection.\r\n\r\nDeveloped by a team of webmasters who wanted to provide greater control over their sites without relying on third-party software or services, HIPHP is a simple and user-friendly solution. By placing the HIPHP_HOLE_CODE in any PHP file within the site’s directory structure, users are granted access rights to make changes from anywhere in the world. This makes it an ideal solution for website owners looking for greater flexibility when managing their online presence.\r\n\r\nSecurity is a top priority for HIPHP, with regular updates ensuring compatibility across different versions of PHP codebase used by popular content management systems (CMS). Its password protection feature adds an additional layer of defense against unauthorized access. HIPHP is a secure solution for those looking to take back full control over their website hosting environment.","id":"090dce7a-daf6-4854-8c74-8378d32bddee","image":"https://raw.githubusercontent.com/yasserbdj96/hiphp/main/install/hiphp.png","source":"https://github.com/yasserbdj96/hiphp","tech":["Python3","PHP","Shell (Bash)","Shell (Batch)","JavaScript","CSS","HTML"],"title":"hiphp"}]}
