{"blogPosts":[{"category":"Personal Journey, Programming, Open Source","content":"    <h1>🚀 Welcome to My World: Where Code Meets Creativity</h1>\r\n<br><br>\r\n    <p>Hi, I'm <strong>Yasser</strong> — a freelance developer, software engineer, and tech enthusiast with a passion for building innovative solutions since 2010. Whether it's crafting automation tools, developing secure backdoors for educational use, or contributing to open-source projects, I'm always up for solving complex problems through clean and creative code.</p>\r\n<br><br>\r\n    <h2>Why This Blog?</h2>\r\n    <p>After more than a decade of working on everything from microcontroller firmware to secure web apps and productivity bots, I felt it was time to open a window into my process, my thoughts, and the tools I build. This blog will be a place to:</p>\r\n    <ul>\r\n        <li>🧠 Share coding tips, tricks, and deep-dive tutorials</li>\r\n        <li>🔐 Discuss cybersecurity topics and ethical hacking practices</li>\r\n        <li>⚙️ Document my Arduino and automation experiments</li>\r\n        <li>📂 Showcase the logic behind my open-source projects</li>\r\n        <li>🛠️ Break down tools I use (or build) for developers and tech teams</li>\r\n        <li>📢 Give updates on releases, features, and upcoming work</li>\r\n    </ul>\r\n<br><br>\r\n    <h2>Who Am I?</h2>\r\n    <p>I graduated with a degree in Electromechanical Engineering from Algeria, and over the years, I’ve expanded my skill set to cover:</p>\r\n    <ul>\r\n        <li>Web development (Front and Backend)</li>\r\n        <li>Cybersecurity tools and concepts</li>\r\n        <li>Arduino/ESP32 microcontroller development</li>\r\n        <li>Open-source frameworks and utilities</li>\r\n        <li>GitHub automation and API bots</li>\r\n        <li>Encryption techniques and custom algorithms</li>\r\n    </ul>\r\n    <p>You can see my full project list in the <a href=\"#project-showcase\">Project Showcase</a>.</p>\r\n<br><br>\r\n    <h2>What's Next?</h2>\r\n    <p>This blog is just the beginning. I’ll be posting <strong>weekly updates</strong>, walkthroughs of my GitHub repositories, lessons from real-world freelance work, and insights on building sustainable open-source software.</p>\r\n    <p>Whether you're a fellow developer, a curious learner, or someone building something cool — welcome. Let’s build, break, and innovate together.</p>\r\n\r\n<br><br>\r\n\r\n    <p>All posts: <a href=\"#\">#yasserbdj96</a></p>","cover":"https://avatars.githubusercontent.com/u/24677945?v=4","date":"2025-05-23","excerpt":"As a self-driven developer from Algeria, I've spent over a decade coding, building, and contributing to open-source projects. Here's a glimpse into how it all started, the challenges I've faced, and the passion that keeps me creating software every day.","id":"55184c5a-db3a-4be5-8a2e-43a9315916da","image":"https://avatars.githubusercontent.com/u/24677945?v=4","readTime":"4 minutes","title":"💻 From Algeria to the World: My Journey as a Developer"}],"projects":[{"cover":"https://raw.githubusercontent.com/yasserbdj96/hiphp/main/screenshot/screenshot.png","description":"The BackDoor of HIPHP gives you the power to control websites based on PHP using HTTP/HTTPS protocol. By sending files, tokens and commands through port 80's POST/GET method, users can access a range of activities such as downloading and editing files. It also allows for connecting to Tor networks with password protection for extra security.","details":"<h1>🚀 WebHole Gets a Major Upgrade: Now Supports All Major Web Languages!</h1>\r\n  <p>We’re excited to announce a brand new build of WebHole — and it’s a big one!</p>\r\n  <p>With this latest release, WebHole now supports all major web languages, expanding its capabilities and opening the door for more developers, testers, and security researchers to integrate it into their workflows.</p>\r\n  <p>👉 Check it out on GitHub: <a href=\"https://github.com/yasserbdj96/WebHole\">WebHole on GitHub</a></p>\r\n  <br><br>\r\n  <h2>🔐 Meet HIPHP — Take Full Control of Your PHP Website</h2>\r\n  <div align=\"center\">\r\n    <img src=\"https://raw.githubusercontent.com/yasserbdj96/hiphp/main/install/hiphp.png\" alt=\"hiphp by yasserbdj96\" height=\"200\">\r\n    <h1>HIPHP</h1>\r\n    <p>An open-source backdoor for remotely managing PHP-based websites via HTTP/S — completely free and designed for full control.</p>\r\n  </div>\r\n  <br><br>\r\n  <h2>🧠 What Is HIPHP?</h2>\r\n  <p>HIPHP (Hidden Interface for PHP) is a powerful and lightweight tool for web developers, penetration testers, and administrators who want full, remote access to their PHP-powered websites.</p>\r\n  <p>By injecting a small code snippet (called HIPHP_HOLE_CODE) into any PHP file on your site, you unlock a wide range of remote functionalities — from file downloads and edits to advanced scripting, directly through HTTP/S using POST/GET requests.</p>\r\n\r\n  <ul>\r\n    <li>✅ Supports Tor for anonymity</li>\r\n    <li>✅ Password protection for security</li>\r\n    <li>✅ Compatible with most CMS platforms</li>\r\n    <li>✅ Simple setup, powerful features</li>\r\n  </ul>\r\n\r\n  <p>This project was built to eliminate the dependency on third-party hosting panels and bloated admin tools. With HIPHP, you can securely and efficiently manage your site from anywhere in the world.</p>\r\n<br><br>\r\n  <h2>💻 Run It Your Way</h2>\r\n  <p>HIPHP offers flexibility for every user:</p>\r\n  <ul>\r\n    <li>Command-Line Interface (CLI)</li>\r\n    <li>Desktop GUI</li>\r\n    <li>Terminal GUI (Tkinter)</li>\r\n    <li>Google Colab integration</li>\r\n    <li>Docker containers</li>\r\n  </ul>\r\n  <p>You can run HIPHP as a standalone script, through pip, or even build it into your CI/CD workflow. Whether you're on Linux, Windows, MacOS, Termux, or inside Docker — HIPHP has you covered.</p>\r\n<br><br>\r\n  <h2>🛠️ Dev-Friendly, Cross-Platform, and Continuously Integrated</h2>\r\n  <p>Thanks to ongoing improvements and a solid CI/CD pipeline, HIPHP is tested and verified across all major operating systems:</p>\r\n  <ul>\r\n    <li>Linux builds</li>\r\n    <li>Windows builds</li>\r\n    <li>MacOS builds</li>\r\n    <li>PIP releases</li>\r\n    <li>Docker Hub and GitHub Container Registry support</li>\r\n    <li>Colab integration</li>\r\n  </ul>\r\n<br><br>\r\n  <h2>🎥 Demo & Screenshots</h2>\r\n  <p>Check out HIPHP in action on the GitHub page.</p>\r\n<br><br>\r\n  <h2>📦 Full Feature Set & Installation Guides</h2>\r\n  <p>HIPHP is fully documented and includes:</p>\r\n  <ul>\r\n    <li>Installation steps for PIP, Termux, Ubuntu, Debian, and more</li>\r\n    <li>Docker commands for fast deployment</li>\r\n    <li>GUI tools and CLI options</li>\r\n    <li>Example use cases, scripts, and demos</li>\r\n    <li>A growing list of supported languages and platforms</li>\r\n  </ul>\r\n  <p>Want to see everything it can do? Visit the full documentation on <a href=\"https://github.com/yasserbdj96/hiphp\">GitHub</a>.</p>\r\n<br><br>\r\n  <h2>🛡️ Security First, Always</h2>\r\n  <p>With built-in password protection, HTTPS/Tor support, and a lightweight footprint, HIPHP is designed to be both powerful and secure. It’s ideal for professionals who need control over remote servers without compromising safety.</p>\r\n<br><br>\r\n  <h2>📈 Stay Connected</h2>\r\n  <p>Join the growing HIPHP community:</p>\r\n  <ul>\r\n    <li>⭐ GitHub: <a href=\"https://github.com/yasserbdj96/hiphp\">HIPHP on GitHub</a></li>\r\n    <li>💬 Gitter Chat: <a href=\"https://gitter.im/yasserbdj96/hiphp\">Join the community</a></li>\r\n    <li>📦 PyPI: <a href=\"https://pypi.org/project/hiphp\">Install from PyPI</a></li>\r\n    <li>🐳 Docker: <a href=\"https://hub.docker.com/r/yasserbdj96/hiphp\">HIPHP on Docker Hub</a></li>\r\n  </ul>\r\n<br><br>\r\n  <h2>❤️ Open Source, Open Power</h2>\r\n  <p>HIPHP is built with love by developers for developers. It’s free, open source, and always improving — and you can be part of it.</p>\r\n  <p>Contributions, stars, forks, and feedback are always welcome!</p>\r\n\r\n  <p>Got questions or want to showcase how you're using HIPHP or WebHole? Leave a comment or open an issue on GitHub!</p>","id":"090dce7a-daf6-4854-8c74-8378d32bddee","image":"https://raw.githubusercontent.com/yasserbdj96/hiphp/main/install/hiphp.png","source":"https://github.com/yasserbdj96/hiphp","tech":["Python3","PHP","Shell (Bash)","Shell (Batch)","JavaScript","CSS","HTML"],"title":"hiphp"}]}
